balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF723.PIC
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="3" edc:beginaddr="0x180" edc:endaddr="0x1a0" edc:regionid="sfr3">
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr0"/>
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr1"/>
        <edc:Mirror edc:nzsize="0x3" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ANSELA" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111" edc:name="ANSELA" edc:nzwidth="0x8" edc:por="--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSA" edc:desc="" edc:mask="0x3f" edc:name="ANSA" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ANSA0" edc:desc="" edc:mask="0x1" edc:name="ANSA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSA1" edc:desc="" edc:mask="0x1" edc:name="ANSA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSA2" edc:desc="" edc:mask="0x1" edc:name="ANSA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSA3" edc:desc="" edc:mask="0x1" edc:name="ANSA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSA4" edc:desc="" edc:mask="0x1" edc:name="ANSA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSA5" edc:desc="" edc:mask="0x1" edc:name="ANSA5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ANSELB" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111" edc:name="ANSELB" edc:nzwidth="0x8" edc:por="--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSB" edc:desc="" edc:mask="0x3f" edc:name="ANSB" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ANSB0" edc:desc="" edc:mask="0x1" edc:name="ANSB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSB1" edc:desc="" edc:mask="0x1" edc:name="ANSB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSB2" edc:desc="" edc:mask="0x1" edc:name="ANSB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSB3" edc:desc="" edc:mask="0x1" edc:name="ANSB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSB4" edc:desc="" edc:mask="0x1" edc:name="ANSB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSB5" edc:desc="" edc:mask="0x1" edc:name="ANSB5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="3"/>
        <edc:Mirror edc:nzsize="0x2" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="-------n" edc:cname="PMCON1" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1------0" edc:name="PMCON1" edc:nzwidth="0x8" edc:por="1------0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD" edc:desc="" edc:mask="0x1" edc:name="RD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PMRD" edc:desc="" edc:mask="0x1" edc:name="PMRD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x20" edc:endaddr="0x70" edc:regionid="gpr0"/>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x70" edc:endaddr="0x80" edc:regionid="gprnobnk"/>
      <edc:GPRDataSector edc:bank="1" edc:beginaddr="0xa0" edc:endaddr="0xf0" edc:regionid="gpr1"/>
      <edc:GPRDataSector edc:bank="1" edc:beginaddr="0xf0" edc:endaddr="0x100" edc:regionid="gpr1s" edc:shadowidref="gprnobnk"/>
      <edc:GPRDataSector edc:bank="2" edc:beginaddr="0x120" edc:endaddr="0x130" edc:regionid="gpr2"/>
      <edc:GPRDataSector edc:bank="2" edc:beginaddr="0x170" edc:endaddr="0x180" edc:regionid="gpr2s" edc:shadowidref="gprnobnk"/>
      <edc:GPRDataSector edc:bank="3" edc:beginaddr="0x1f0" edc:endaddr="0x200" edc:regionid="gpr3" edc:shadowidref="gprnobnk"/>
      <edc:EmulatorZone edc:beginaddr="0x18e" edc:endaddr="0x190" edc:regionid="emulatorzone"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:PinList>
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="RE3"/>
      <edc:VirtualPin edc:name="MCLR"/>
      <edc:VirtualPin edc:name="Vpp"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="nSS" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="Vcap"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="AN1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="AN2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="Vref"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="CPS6"/>
      <edc:VirtualPin edc:name="T0CKI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="CPS7"/>
      <edc:VirtualPin edc:name="nSS" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="Vcap"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 9-->
      <edc:VirtualPin edc:name="RA7"/>
      <edc:VirtualPin edc:name="OSC1"/>
      <edc:VirtualPin edc:name="CLKIN"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 10-->
      <edc:VirtualPin edc:name="RA6"/>
      <edc:VirtualPin edc:name="OSC2"/>
      <edc:VirtualPin edc:name="CLKOUT"/>
      <edc:VirtualPin edc:name="Vcap"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 11-->
      <edc:VirtualPin edc:name="RC0"/>
      <edc:VirtualPin edc:name="T1OSO"/>
      <edc:VirtualPin edc:name="T1CKI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 12-->
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="T1OSI"/>
      <edc:VirtualPin edc:name="CCP2" edc:ppsval="0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 13-->
      <edc:VirtualPin edc:name="RC2"/>
      <edc:VirtualPin edc:name="CCP1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 14-->
      <edc:VirtualPin edc:name="RC3"/>
      <edc:VirtualPin edc:name="SCK"/>
      <edc:VirtualPin edc:name="SCL"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 15-->
      <edc:VirtualPin edc:name="RC4"/>
      <edc:VirtualPin edc:name="SDI"/>
      <edc:VirtualPin edc:name="SDA"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 16-->
      <edc:VirtualPin edc:name="RC5"/>
      <edc:VirtualPin edc:name="SDO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 17-->
      <edc:VirtualPin edc:name="RC6"/>
      <edc:VirtualPin edc:name="TX"/>
      <edc:VirtualPin edc:name="CK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 18-->
      <edc:VirtualPin edc:name="RC7"/>
      <edc:VirtualPin edc:name="RX"/>
      <edc:VirtualPin edc:name="DT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 19-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 20-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 21-->
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="AN12"/>
      <edc:VirtualPin edc:name="CPS0"/>
      <edc:VirtualPin edc:name="INT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 22-->
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="CPS1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 23-->
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="AN8"/>
      <edc:VirtualPin edc:name="CPS2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 24-->
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="AN9"/>
      <edc:VirtualPin edc:name="CPS3"/>
      <edc:VirtualPin edc:name="CCP2" edc:ppsval="1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 25-->
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="CPS4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 26-->
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="AN13"/>
      <edc:VirtualPin edc:name="CPS5"/>
      <edc:VirtualPin edc:name="T1G"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 27-->
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="ICSPCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 28-->
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="ICSPDAT"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>